app/controllers/favorites_controller.rb

  def create
    favorite = Favorite.new
    favorite.user_id = current_user.id
    favorite.topic_id = params[:topic_id]

    if favorite.save
---
INSERT INTO `favorites` (`user_id`, `topic_id`, `created_at`, `updated_at`) VALUES (8, 1, '2021-08-09 17:14:15', '2021-08-09 17:14:15')

  def destroy
    @favorite = Favorite.find_by(user_id: current_user.id, topic_id: params[:topic_id])
    @favorite.destroy
---
SELECT  `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 8 AND `favorites`.`topic_id` = 1 LIMIT 1
DELETE FROM `favorites` WHERE `favorites`.`id` = 1