app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('ほむきち', 'test@test.test', '2021-08-06 15:15:13', '2021-08-06 15:15:13', '$2a$12$smTeQsMJRSNBBSt/E7rPP.4CZ6gL8EmAFToCj3it99a.rg9X64pBS')
---
  def create
    @user = User.new(user_params)
    if @user.save